Конфигурация/InformationRegisters/УсловияДоговоровОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровОбщие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантДлиныСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДлиныСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ИсходящийДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИсходящийДокумент</Name>
			<BasedOn>
				<xr:Item>Document.ВходящийДокумент</xr:Item>
				<xr:Item>Document.Нарушение</xr:Item>
				<xr:Item>Document.УстранениеНарушения</xr:Item>
				<xr:Item>Document.ВнесениеИзмененийВоВнутреннийПеречень</xr:Item>
				<xr:Item>Catalog.Договоры</xr:Item>
				<xr:Item>Catalog.СчетаДоверительногоУправления</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеИзмененийВоВнутреннийПеречень</v8:Type>
						<v8:Type>cfg:DocumentRef.УстранениеНарушения</v8:Type>
						<v8:Type>cfg:DocumentRef.Нарушение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаклейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииУКПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСобственнойДеятельностиУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветПоСуществу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолПолучателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВходящийДокумент</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнесениеИзмененийВоВнутреннийПеречень</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
								<v8:Type>cfg:DocumentRef.УстранениеНарушения</v8:Type>
								<v8:Type>cfg:DocumentRef.Нарушение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСДокументооборотом/Ext/Module.bsl
Процедура ПриУстановкеНовогоНомера(Объект, СтандартнаяОбработка, Префикс) Экспорт

	ИмяРеквизитаДата = "Дата";
	ИмяРеквизитаНомер = "Номер";
	Дата = Объект[ИмяРеквизитаДата];
		
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ВнутреннийДокумент") Тогда
		
		Если Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
			Префикс = Формат(Дата, "ДФ='''РТ/''yyyy/MM/dd''-'''");
		ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст") Тогда
			Префикс = Формат(Дата, "ДФ='''МДТ/''yyMMdd''/'''");
		ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
			Префикс = Формат(Дата, "ДФ='''ЭМ/''yyyy/MM/dd''-'''");
		КонецЕсли;
		
	Иначе
		
		Если Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ") Тогда
			Префикс = Формат(Дата, "ДФ='''РТ''ddMMyy''/'''");
		ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_МДТраст") Тогда
			Префикс = Формат(Дата, "ДФ='''МДТ''ddMMyy''/'''");
		ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ") Тогда
			
			Префикс = Формат(Дата, "ДФ='''ЭМ.03.''ddMMyy''/'''");
			
			Если ТипЗнч(Объект) = Тип("СправочникОбъект.Доверенности") Тогда
				Префикс = СтрЗаменить(Префикс, ".03.", "");
			КонецЕсли;			
			
		ИначеЕсли Объект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") Тогда
			Префикс = Объект.Организация.ПрефиксНумерации + "-" +  Формат(Дата, "ДФ=ггггММдд") + "-";
			Возврат;
		КонецЕсли;		
	
	КонецЕсли; 
	
	Если Префикс = "" Тогда
		Возврат;
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь;
		
	ИмяОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Объект)).ПолноеИмя();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить(ИмяОбъекта);
	ЭлементБлокировки.УстановитьЗначение("Организация", Объект.Организация);
	Диапазон = Новый Диапазон(НачалоДня(Дата), КонецДня(Дата));
	ЭлементБлокировки.УстановитьЗначение(ИмяРеквизитаДата, Диапазон);
	
	Блокировка.Заблокировать();
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Объект.Номер КАК Номер,
		|	0 КАК НомерЧисло
		|ИЗ
		|	Документ.ВходящийДокумент КАК Объект
		|ГДЕ
		|	Объект.Организация = &Организация
		|	И Объект.Дата МЕЖДУ &НачалоДня И &КонецДня
		|	И Объект.Номер ПОДОБНО &Префикс
		|	И Объект.Ссылка <> &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ВходящийДокумент", ИмяОбъекта);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Объект.Дата", "Объект." + ИмяРеквизитаДата);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Объект.Номер", "Объект." + ИмяРеквизитаНомер);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НачалоДня", Диапазон.Начало);
	Запрос.УстановитьПараметр("КонецДня", Диапазон.Конец);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Префикс", Префикс + "%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекущийНомер = 0;
	Иначе
		ТаблицаНомеров = РезультатЗапроса.Выгрузить();
		Для каждого СтрокаТаблицаНомеров Из ТаблицаНомеров Цикл
			НомерБезПрефиксаИПробелов = СтрЗаменить(СтрЗаменить(СтрокаТаблицаНомеров.Номер, Префикс, "") , " ", "");
			Если РаботаСоСтрокамиКлиентСервер.ТолькоЦифрыВСтроке(НомерБезПрефиксаИПробелов) Тогда
				СтрокаТаблицаНомеров.НомерЧисло = Число(НомерБезПрефиксаИПробелов);
			КонецЕсли; 
		КонецЦикла; 
		ТаблицаНомеров.Сортировать("НомерЧисло");
		ТекущийНомер = ТаблицаНомеров[Таблицаномеров.Количество()-1].НомерЧисло;
	КонецЕсли; 
	
	Объект[ИмяРеквизитаНомер] = Префикс + (ТекущийНомер + 1);

КонецПроцедуры
 
Функция ПолучитьДействующиеЛицензииПоДоговорамКлиента(Дата, Организация, Клиент) Экспорт
	
	СтруктураЛицензий = Новый Структура("ПоЛицензииУКПИФ, ПоЛицензииДУ", Ложь, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Отбор = Новый Структура("Организация, Клиент", Организация, Клиент);
	Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, Дата, Отбор);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Лицензии.ВидДеятельности КАК ВидДеятельности
		|ИЗ
		|	РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			(Организация, СчетДоверительногоУправления) В
		|				(ВЫБРАТЬ
		|					&Организация,
		|					ДействующиеСчетаДУ.Ссылка КАК Ссылка
		|				ИЗ
		|					ДействующиеСчетаДУ КАК ДействующиеСчетаДУ)) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лицензии КАК Лицензии
		|		ПО ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Лицензия = Лицензии.Ссылка
		|ГДЕ
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	ЛицензииМенеджер = Справочники.ВидыДеятельности;
	
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.ВидДеятельности = ЛицензииМенеджер.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ Тогда
			СтруктураЛицензий.Вставить("ПоЛицензииУКПИФ", Истина);
		ИначеЕсли Выборка.ВидДеятельности = ЛицензииМенеджер.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами Тогда 
			СтруктураЛицензий.Вставить("ПоЛицензииДУ", Истина);
		КонецЕсли; 
	
	КонецЦикла; 
	
	Возврат СтруктураЛицензий;
	
КонецФункции

Функция ПолучитьМассивДоговоровКлиента(Период, Клиент, Организация) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления КАК КлиентыДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО КлиентыДоверительногоУправления.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|			И (КлиентыДоверительногоУправления.Клиент = &Клиент)
		|			И (СчетаДоверительногоУправления.Организация = &Организация)
		|			И (СчетаДоверительногоУправления.ДатаЗаключения <= &Период)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Договоры.Ссылка
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.Организация = &Организация
		|	И Договоры.Контрагент = &Клиент
		|	И Договоры.ДатаЗаключения <= &Период";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);

КонецФункции

Процедура УстановитьПереключательТипаЮрФизЛицоСтрока(Переключатель, Владелец) Экспорт

	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		Переключатель = 1;
	ИначеЕсли ТипЗнч(Владелец) = Тип("Строка") Тогда
		Переключатель = 2;
	Иначе // Неопределено
		Переключатель = 1;
		Владелец = Справочники.ЮрФизЛица.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры 

Процедура ЗаполнитьДанныеПоДоговорам(Объект, ИдентификаторСтроки = Неопределено) Экспорт

	Если ИдентификаторСтроки = Неопределено Тогда
		НомерСтроки = Неопределено;
	Иначе
		ТекСтрока = Объект.Договоры.НайтиПоИдентификатору(ИдентификаторСтроки);
		НомерСтроки = ТекСтрока.НомерСтроки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договоры", 		Объект.Договоры.Выгрузить());
	Запрос.УстановитьПараметр("НомерСтроки",	НомерСтроки);
	Запрос.УстановитьПараметр("Период", 		Объект.Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Договоры.НомерСтроки КАК НомерСтроки,
		|	Договоры.Договор КАК Договор
		|ПОМЕСТИТЬ _Договоры
		|ИЗ
		|	&Договоры КАК Договоры
		|ГДЕ
		|	(&НомерСтроки = НЕОПРЕДЕЛЕНО
		|			ИЛИ Договоры.НомерСтроки = &НомерСтроки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	_Договоры.Договор КАК Договор,
		|	_Договоры.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ _РеквизитыДоговоров
		|ИЗ
		|	_Договоры КАК _Договоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО _Договоры.Договор = СчетаДоверительногоУправления.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Договоры.ВидДоговора,
		|	Договоры.НомерДоговора,
		|	Договоры.ДатаЗаключения,
		|	УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения,
		|	_Договоры.Договор,
		|	_Договоры.НомерСтроки
		|ИЗ
		|	_Договоры КАК _Договоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, ) КАК УсловияДоговоровОбщиеСрезПоследних
		|			ПО Договоры.Ссылка = УсловияДоговоровОбщиеСрезПоследних.Договор
		|		ПО _Договоры.Договор = Договоры.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РеквизитыДоговоров.ВидДоговора КАК ВидДоговора,
		|	_РеквизитыДоговоров.НомерДоговора КАК Номер,
		|	_РеквизитыДоговоров.ДатаЗаключения КАК ДатаЗаключения,
		|	_РеквизитыДоговоров.ДатаРасторжения КАК ДатаРасторжения,
		|	_РеквизитыДоговоров.Договор КАК Договор,
		|	_РеквизитыДоговоров.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	_РеквизитыДоговоров КАК _РеквизитыДоговоров
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Если ИдентификаторСтроки = Неопределено Тогда
		Объект.Договоры.Загрузить(Запрос.Выполнить().Выгрузить());
	Иначе
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			// Очистим все значения
			Для каждого Колонка Из Результат.Колонки Цикл
				Если Колонка.Имя <> "НомерСтроки" Тогда
					ТекСтрока[Колонка.Имя] = Неопределено;
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(ТекСтрока, Выборка);
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Функция ПолучитьЮрФизЛицоДляСчетаДоверительногоУправления(СчетДоверительногоУправления) Экспорт	
	
	Если ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		Возврат Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления)
	Иначе
		Возврат Справочники.ЮрФизЛица.ПустаяСсылка();
	КонецЕсли;	

КонецФункции

Функция ПолучитьИсходящиеДокументыБезСодержания(ИсходящиеДокументы) Экспорт

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсходящийДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИсходящийДокумент КАК ИсходящийДокумент
		|ГДЕ
		|	ИсходящийДокумент.Ссылка В(&Ссылка)
		|	И (ВЫРАЗИТЬ(ИсходящийДокумент.Содержание КАК СТРОКА(1024))) = """"";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ИсходящиеДокументы);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить().ВыгрузитьКолонку(0); 

КонецФункции 
 
Процедура ЗаполнитьСтандартноеСодержаниеИсходящихДокументов(ИсходящиеДокументы, РежимЗаполнения) Экспорт

	Для каждого ИсходящийДокумент Из ИсходящиеДокументы Цикл
	
		Содержание = "";
			
		Если РежимЗаполнения = "ОтветНаОбращение" Тогда
			
			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсходящийДокумент, "Дата, Организация, Основания");
			Содержание = Документы.ИсходящийДокумент.ПолучитьСодержаниеОтветаНаОбращение(
				РеквизитыДокумента.Дата, 
				РеквизитыДокумента.Организация, 
				РеквизитыДокумента.Основания.Выгрузить().ВыгрузитьКолонку("Основание"));
				
		ИначеЕсли РежимЗаполнения = "УведомлениеОбЭДО" Тогда
			
			Содержание = Документы.ИсходящийДокумент.ПолучитьСодержаниеУведомленияОбЭДО(ИсходящийДокумент);
			
		Иначе
			
			ВызватьИсключение СтрШаблон("Заполнение содержания для режима '%1' не реализовано", РежимЗаполнения);
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(Содержание) Тогда
			
			Попытка
				
				Объект = ИсходящийДокумент.ПолучитьОбъект();
				Объект.Содержание = Содержание;
				Объект.Записать();			
				
			Исключение
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заполнить содержание документа " + ИсходящийДокумент + Символы.ПС + "Система сообщает: " + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры
